Ran Plan for project: `wrestleutopia-prod` dir: `accounts/wrestleutopia-prod` workspace: `default`

<details><summary>Show Output</summary>

```diff
Wrote /home/atlantis/.atlantis/prod-ue2-multiaccounts.tfvars with secrets from SSM.


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_cloudwatch_event_rule.cognito_cleanup_rule will be created
+ resource "aws_cloudwatch_event_rule" "cognito_cleanup_rule" {
      + arn                 = (known after apply)
      + event_bus_name      = "default"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "wrestleutopia-cognito-cleanup-hourly"
      + name_prefix         = (known after apply)
      + region              = "us-east-2"
      + schedule_expression = "rate(1 hour)"
      + tags_all            = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
    }

  # aws_cloudwatch_event_target.cognito_cleanup_target will be created
+ resource "aws_cloudwatch_event_target" "cognito_cleanup_target" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + region         = "us-east-2"
      + rule           = "wrestleutopia-cognito-cleanup-hourly"
      + target_id      = "lambda"
    }

  # aws_iam_policy.cognito_cleanup_policy will be created
+ resource "aws_iam_policy" "cognito_cleanup_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "List and delete UNCONFIRMED Cognito users"
      + id               = (known after apply)
      + name             = "wrestleutopia-cognito-cleanup-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "cognito-idp:ListUsers",
                          + "cognito-idp:AdminDeleteUser",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:cognito-idp:us-east-2:390402544450:userpool/us-east-2_9oCzdeOZF"
                    },
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
    }

  # aws_iam_role.cognito_cleanup_role will be created
+ resource "aws_iam_role" "cognito_cleanup_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "wrestleutopia-cognito-cleanup-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.cognito_cleanup_attach will be created
+ resource "aws_iam_role_policy_attachment" "cognito_cleanup_attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "wrestleutopia-cognito-cleanup-role"
    }

  # aws_lambda_function.cognito_cleanup will be created
+ resource "aws_lambda_function" "cognito_cleanup" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "./artifacts/scripts/cognito_cleanup/cognito_cleanup.zip"
      + function_name                  = "wrestleutopia-cognito-cleanup"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "us-east-2"
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::390402544450:role/wrestleutopia-postconfirm-role"
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "lg9qqRIIooo4I9KY9B+WIRlMzflyN4bSGyRUmU1ogKE="
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
      + timeout                        = 10
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "MAX_AGE_HOURS" = "24"
              + "USER_POOL_ID"  = "us-east-2_9oCzdeOZF"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # aws_lambda_permission.allow_events_cleanup will be created
+ resource "aws_lambda_permission" "allow_events_cleanup" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "wrestleutopia-cognito-cleanup"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + region              = "us-east-2"
      + source_arn          = (known after apply)
      + statement_id        = "AllowEventInvoke"
      + statement_id_prefix = (known after apply)
    }

Plan: 7 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p wrestleutopia-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.feedutopia.com:4141/lock?id=ryan-longoria%252FFeedUtopia%252Faccounts%252Fwrestleutopia-prod%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p wrestleutopia-prod
  ```
Plan: 7 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```